Revit 2024 API
Document.IsDefaultElementTypeIdValid Method
 Checks whether the element type id is valid for the give DefaultElmentType id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool IsDefaultElementTypeIdValid(
	ElementTypeGroup defaultTypeId,
	ElementId typeId
)
Visual Basic
Public Function IsDefaultElementTypeIdValid ( _
	defaultTypeId As ElementTypeGroup, _
	typeId As ElementId _
) As Boolean
Visual C++
public:
bool IsDefaultElementTypeIdValid(
	ElementTypeGroup defaultTypeId,
	ElementId^ typeId
)
Parameters
defaultTypeId
Type: Autodesk.Revit.DB.ElementTypeGroup
 The default element type id.
typeId
Type: Autodesk.Revit.DB.ElementId
 The element type id.
Return Value
 True if the element type id is valid for the give DefaultElmentType id, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Document Class
Autodesk.Revit.DB Namespace